Terraform plan for __staging__
<details>
<summary>Plan: 1 to add, 2 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # cloudfoundry_service_instance.k8s_cluster will be created
  + resource "cloudfoundry_service_instance" "k8s_cluster" {
      + id                             = (known after apply)
      + name                           = "ssb-solr-k8s"
      + recursive_delete               = false
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "75ff550a-1f72-4bc2-9bd9-644a174a3384"
      + space                          = "5edc803e-3376-4788-b72c-a152f11925b0"
      + tags                           = [
          + "k8s",
        ]

      + timeouts {
          + create = "60m"
          + delete = "40m"
          + update = "90m"
        }
    }

  # module.broker_eks.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
        id                         = "3419cc02-1451-4dc5-a75e-01326c542e16"
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-eks"
      ~ source_code_hash           = "rV1qiROKRbacrN2Whbidd6KrRZSsTJfU3RArsNcpjxI=" -> "pyX/oCezxIthNRXW/E8TTCbN0bY0NkXu8xbvNAC5ZyI="
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.broker_solr.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
        id                         = "b97c47f9-d664-4236-b8c7-c42076722f9e"
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-solr"
        # (19 unchanged attributes hidden)


      + service_binding {
          + service_instance = (known after apply)
        }
        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [plan #127](https://github.com/GSA/datagov-ssb/actions/runs/1496334537)